# Pandas data proccess
* Environment require **Python 3+**

In [149]:
import pandas as pd

# Import csv data with pandas

In [150]:
df = pd.read_csv(r'C:\Users\oc06\Desktop\Python code\PyOllyTutorial\DataBase\CSVData.csv')

# Explore data format
* Check data frame infomation

In [4]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 7 columns):
ID                14 non-null int64
Date              14 non-null object
Country           14 non-null object
Star              14 non-null int64
Total Customer    13 non-null float64
Status            12 non-null object
Target            14 non-null object
dtypes: float64(1), int64(2), object(4)
memory usage: 864.0+ bytes
None

* Check head & tail

In [90]:
print(df.head())
print(df.tail())

   ID           Date Country  Star  Total Customer Status
0   1  6/9/2017 0:00     USA     6       5244337.0      O
1   2  6/9/2017 0:00  Canada     5       3531127.0      R
2   3  6/9/2017 0:00  French     5        253535.0      I
3   4  6/9/2017 0:00  Taiwan     4       5165465.0    NaN
4   5  6/9/2017 0:00   Japan     6             NaN    NaN
    ID            Date  Country  Star  Total Customer Status
9    3  6/10/2017 0:00   French     4        253952.0      I
10   4  6/10/2017 0:00   Taiwan     7       5865521.0      I
11   5  6/10/2017 0:00    Japan     6         19752.0      Q
12   6  6/10/2017 0:00    Korea     5         96211.0      O
13   7  6/10/2017 0:00  England     5       4852122.0      R

* Check columns name

In [91]:
df.columns

Index(['ID', 'Date', 'Country', 'Star', 'Total Customer', 'Status'], dtype='object')

* Check how many rows * columns

In [92]:
df.shape

(14, 6)

# Basic Analysis

* Summary describe

In [93]:
df.describe()

C:\Miniconda3\lib\site-packages\numpy\lib\function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

              ID       Star  Total Customer
count  14.000000  14.000000    1.300000e+01
mean    4.000000   5.285714    3.034513e+06
std     2.075498   1.069045    2.481656e+06
min     1.000000   4.000000    1.654600e+04
25%     2.250000   4.250000             NaN
50%     4.000000   5.000000             NaN
75%     5.750000   6.000000             NaN
max     7.000000   7.000000    5.865521e+06

* Count (without Nan)

In [94]:
df['Status'].count()

12

* Mean

In [95]:
df['Total Customer'].mean()

3034512.6923076925

* Standard Deviation

In [96]:
df['Total Customer'].std()

2481656.372605213

* Maxmum/Minimum

In [97]:
df['Total Customer'].max()
df['Total Customer'].min()

16546.0

* Value counts

In [98]:
df['Status'].value_counts(dropna=False)

I      4
R      4
O      3
NaN    2
Q      1
Name: Status, dtype: int64

# Deal with Nan

* Count how many Nan values for each columns

In [99]:
df.isnull().sum()
# df.notnull().sum()

ID                0
Date              0
Country           0
Star              0
Total Customer    1
Status            2
dtype: int64

* Keep Nan rows for specific column

In [100]:
df[df.Status.isnull()]

   ID           Date Country  Star  Total Customer Status
3   4  6/9/2017 0:00  Taiwan     4       5165465.0    NaN
4   5  6/9/2017 0:00   Japan     6             NaN    NaN

* Drop Columns or Rows with Nan
* Drop according to column : axis = 1; drop according to rows: axis = 0 
* Criteria : how='any' or 'all

In [101]:
df.dropna(axis=0)

    ID            Date  Country  Star  Total Customer Status
0    1   6/9/2017 0:00      USA     6       5244337.0      O
1    2   6/9/2017 0:00   Canada     5       3531127.0      R
2    3   6/9/2017 0:00   French     5        253535.0      I
5    6   6/9/2017 0:00    Korea     4         16546.0      R
6    7   6/9/2017 0:00  England     7       4461441.0      I
7    1  6/10/2017 0:00      USA     4       5852132.0      O
8    2  6/10/2017 0:00   Canada     6       3836524.0      R
9    3  6/10/2017 0:00   French     4        253952.0      I
10   4  6/10/2017 0:00   Taiwan     7       5865521.0      I
11   5  6/10/2017 0:00    Japan     6         19752.0      Q
12   6  6/10/2017 0:00    Korea     5         96211.0      O
13   7  6/10/2017 0:00  England     5       4852122.0      R

In [102]:
df.dropna(subset=['Total Customer', 'Status'], how='all')

    ID            Date  Country  Star  Total Customer Status
0    1   6/9/2017 0:00      USA     6       5244337.0      O
1    2   6/9/2017 0:00   Canada     5       3531127.0      R
2    3   6/9/2017 0:00   French     5        253535.0      I
3    4   6/9/2017 0:00   Taiwan     4       5165465.0    NaN
5    6   6/9/2017 0:00    Korea     4         16546.0      R
6    7   6/9/2017 0:00  England     7       4461441.0      I
7    1  6/10/2017 0:00      USA     4       5852132.0      O
8    2  6/10/2017 0:00   Canada     6       3836524.0      R
9    3  6/10/2017 0:00   French     4        253952.0      I
10   4  6/10/2017 0:00   Taiwan     7       5865521.0      I
11   5  6/10/2017 0:00    Japan     6         19752.0      Q
12   6  6/10/2017 0:00    Korea     5         96211.0      O
13   7  6/10/2017 0:00  England     5       4852122.0      R

* Other format Nan

In [103]:
df['Status'].fillna(value='Missing',inplace=True)
df.head()

   ID           Date Country  Star  Total Customer   Status
0   1  6/9/2017 0:00     USA     6       5244337.0        O
1   2  6/9/2017 0:00  Canada     5       3531127.0        R
2   3  6/9/2017 0:00  French     5        253535.0        I
3   4  6/9/2017 0:00  Taiwan     4       5165465.0  Missing
4   5  6/9/2017 0:00   Japan     6             NaN  Missing

* Summary describe (after clean Nan)

In [104]:
df.dropna().describe()

              ID       Star  Total Customer
count  13.000000  13.000000    1.300000e+01
mean    3.923077   5.230769    3.034513e+06
std     2.139374   1.091928    2.481656e+06
min     1.000000   4.000000    1.654600e+04
25%     2.000000   4.000000    2.535350e+05
50%     4.000000   5.000000    3.836524e+06
75%     6.000000   6.000000    5.165465e+06
max     7.000000   7.000000    5.865521e+06

# Replace

In [105]:
df.loc[:, 'Country'].replace(['Canada','Korea','French','England','Japan','Taiwan'], 
                             ['CA','KA','FH','UK','JP','TW'], inplace=True)
df.head()

   ID           Date Country  Star  Total Customer   Status
0   1  6/9/2017 0:00     USA     6       5244337.0        O
1   2  6/9/2017 0:00      CA     5       3531127.0        R
2   3  6/9/2017 0:00      FH     5        253535.0        I
3   4  6/9/2017 0:00      TW     4       5165465.0  Missing
4   5  6/9/2017 0:00      JP     6             NaN  Missing

# Select

In [184]:
df[['Country','Star']].head()

  Country  Star
0     USA     6
1      CA     5
2      FH     5
3      TW     4
4      JP     6

# Where
```SQL
SELECT    *
FROM      df
WHERE     Status='O'
```

In [177]:
df[df['Status']=='O']

    ID            Date Country  Star  Total Customer Status StarLevel
0    1   6/9/2017 0:00     USA     6       5244337.0      O    Medium
7    1  6/10/2017 0:00     USA     4       5852132.0      O       Low
12   6  6/10/2017 0:00      KA     5         96211.0      O       Low

* AND : **&**; OR : **|**
```SQL
SELECT    *
FROM      df
WHERE     Status='O'
AND       Star>=5
```

In [178]:
df[(df['Status']=='O') & 
   (df['Star']>=5)]

    ID            Date Country  Star  Total Customer Status StarLevel
0    1   6/9/2017 0:00     USA     6       5244337.0      O    Medium
12   6  6/10/2017 0:00      KA     5         96211.0      O       Low

# Group by
* df.**groupby**().**size**()

```SQL
SELECT    Status,
          COUNT(1)
FROM      df
GROUP BY  Status
```

In [231]:
df.groupby(['Status']).size()

Status
I          4
Missing    2
O          3
Q          1
R          4
dtype: int64

* df.**groupby**().**max**()
* You can use : sum(), min(), max(), median(), count().size()

```SQL
SELECT    Country,
          MAX(Start) AS Start,
          MAX(Total Customer) AS [Total Customer]
FROM      df
GROUP BY  Country
```

In [227]:
df.groupby(['Country']).max()[['Star','Total Customer']]

         Star  Total Customer
Country
CA          6       3836524.0
FH          5        253952.0
JP          6         19752.0
KA          5         96211.0
TW          7       5865521.0
UK          7       4852122.0
USA         6       5852132.0

* df.**groupby**().**agg**()
* You can use : np.mean, np.size, np.std, np.

```SQL
SELECT    Country,
          AVG(Star) AS mean,
          Std(Star) AS std,
          Med(Star) AS median
FROM      df
GROUP BY  Country
```

In [230]:
import numpy as np
df.groupby(['Country']).agg({'Star': [np.mean,np.std,np.median]}).head()
# df.groupby(['Country']).agg([np.mean,np.std,np.median]).head()

        Star
        mean       std median
Country
CA       5.5  0.707107    5.5
FH       4.5  0.707107    4.5
JP       6.0  0.000000    6.0
KA       4.5  0.707107    4.5
TW       5.5  2.121320    5.5

# Sort by

* df.groupby().sum().**sort_values**()
* Default sort is ascending

```SQL
SELECT    Country,
          MAX(Start) AS Start,
          MAX(Total Customer) AS [Total Customer]
FROM      df
GROUP BY  Country
ORDER BY  MAX(Total Customer) DESC
```

In [232]:
df.groupby(['Country']).max()[['Star','Total Customer']].sort_values(['Total Customer'], ascending=False)

         Star  Total Customer
Country
TW          7       5865521.0
USA         6       5852132.0
UK          7       4852122.0
CA          6       3836524.0
FH          5        253952.0
KA          5         96211.0
JP          6         19752.0

```SQL
SELECT    *
FROM      df
GROUP BY  Country
ORDER BY  Star
```

In [233]:
df.sort_values(['Star'])

    ID            Date Country  Star  Total Customer   Status StarLevel
3    4   6/9/2017 0:00      TW     4       5165465.0  Missing       Low
5    6   6/9/2017 0:00      KA     4         16546.0        R       Low
7    1  6/10/2017 0:00     USA     4       5852132.0        O       Low
9    3  6/10/2017 0:00      FH     4        253952.0        I       Low
1    2   6/9/2017 0:00      CA     5       3531127.0        R       Low
2    3   6/9/2017 0:00      FH     5        253535.0        I       Low
12   6  6/10/2017 0:00      KA     5         96211.0        O       Low
13   7  6/10/2017 0:00      UK     5       4852122.0        R       Low
0    1   6/9/2017 0:00     USA     6       5244337.0        O    Medium
4    5   6/9/2017 0:00      JP     6             NaN  Missing    Medium
8    2  6/10/2017 0:00      CA     6       3836524.0        R    Medium
11   5  6/10/2017 0:00      JP     6         19752.0        Q    Medium
6    7   6/9/2017 0:00      UK     7       4461441.0        I    Medium
10   4  6/10/2017 0:00      TW     7       5865521.0        I    Medium

# Case When

In [166]:
def StarLevelConvert(df):
    if (df['Star']>0) & (df['Star']<=5):
        return 'Low'
    elif (df['Star']>5) & (df['Star']<=10):
        return 'Medium'
    elif df['Star']>10:
        return 'High'
    else:
        return np.nan

In [167]:
df['StarLevel']=df.apply(StarLevelConvert, axis=1)
df.head()

   ID           Date Country  Star  Total Customer   Status StarLevel
0   1  6/9/2017 0:00     USA     6       5244337.0        O    Medium
1   2  6/9/2017 0:00      CA     5       3531127.0        R       Low
2   3  6/9/2017 0:00      FH     5        253535.0        I       Low
3   4  6/9/2017 0:00      TW     4       5165465.0  Missing       Low
4   5  6/9/2017 0:00      JP     6             NaN  Missing    Medium

# Join

In [244]:
df1 = pd.DataFrame({'Name':['Olly','Ollier','Oil','Ola'],
                    'age':[13,25,60,65]})
df2 = pd.DataFrame({'Name':['Olly','Ola','Ola'],
                    'height':[130,165,120]})
print(df1.head())
print(df2.head())

     Name  age
0    Olly   13
1  Ollier   25
2     Oil   60
3     Ola   65
   Name  height
0  Olly     130
1   Ola     165
2   Ola     120

* Inner join
```SQL
SELECT      *
FROM        df1 a 
INNER JOIN  df2 b
ON          a.Name=b.Name
```

In [247]:
pd.merge(df1, df2, on='Name', how='inner')

   Name  age  height
0  Olly   13     130
1   Ola   65     165
2   Ola   65     120

* Left join
```SQL
SELECT      *
FROM        df1 a 
LEFT JOIN   df2 b
ON          a.Name=b.Name
```

In [248]:
pd.merge(df1, df2, on='Name', how='left')

     Name  age  height
0    Olly   13   130.0
1  Ollier   25     NaN
2     Oil   60     NaN
3     Ola   65   165.0
4     Ola   65   120.0

* Right join

```SQL
SELECT      *
FROM        df1 a 
RIGHT JOIN  df2 b
ON          a.Name=b.Name
```

In [249]:
pd.merge(df1, df2, on='Name', how='right')

   Name  age  height
0  Olly   13     130
1   Ola   65     165
2   Ola   65     120

# Union

* Union ALL

In [254]:
df3 = pd.DataFrame({'Name':['Olly','Olly','Dog'],
                    'age':[13,13,20]})
print(df1)
print(df3)

     Name  age
0    Olly   13
1  Ollier   25
2     Oil   60
3     Ola   65
   Name  age
0  Olly   13
1  Olly   13
2   Dog   20

In [256]:
pd.concat([df1, df3])

     Name  age
0    Olly   13
1  Ollier   25
2     Oil   60
3     Ola   65
0    Olly   13
1    Olly   13
2     Dog   20

In [257]:
pd.concat([df1, df3]).drop_duplicates()

     Name  age
0    Olly   13
1  Ollier   25
2     Oil   60
3     Ola   65
2     Dog   20

# Odds Ratio Caculator

In [145]:
def OddsRatio(df=None,TargetCol=None,var=None):
    df_YN = df[(df[TargetCol]=='Y')|(df[TargetCol]=='N')].groupby(var, as_index=False).count()[[var,TargetCol]]
    df_Y = df[df[TargetCol]=='Y'].groupby(var, as_index=False).count()[[var,TargetCol]]
    df_N = df[df[TargetCol]=='N'].groupby(var, as_index=False).count()[[var,TargetCol]]
    df_YN.rename(columns={TargetCol:'Total'}, inplace=True)
    df_Y.rename(columns={TargetCol:'Y'}, inplace=True)
    df_N.rename(columns={TargetCol:'N'}, inplace=True)
    join_Y = pd.merge(df_YN, df_Y, on=var, how='left').fillna(0)
    join = pd.merge(join_Y, df_N, on=var, how='left').fillna(0)
    join['Odds'] = join['Y']/join['Total']
    join['BaseOdds'] = join['Y'].sum()/join['Total'].sum()
    join['OddsRatio'] = join['Odds']/join['BaseOdds']
    return join

In [148]:
OddsRatio(df=df, TargetCol='Target', var='Status')

  Status  Total    Y  N      Odds  BaseOdds  OddsRatio
0      I      4  2.0  2  0.500000  0.583333   0.857143
1      O      3  2.0  1  0.666667  0.583333   1.142857
2      Q      1  0.0  1  0.000000  0.583333   0.000000
3      R      4  3.0  1  0.750000  0.583333   1.285714

# Reference
* Ref : [Python & SQL](https://pandas.pydata.org/pandas-docs/stable/comparison_with_sql.html)